Repository: brockallen/BrockAllen.MembershipReboot
Catalog: src/BrockAllen.MembershipReboot/Resources/ValidationMessages.*.resx
Languages: de, fi, fr, it_it, nl_nl, no, pt_br, ru_ru, sk, sv, zh_cn

# AccountAlreadyVerified
source: The email address for this account is already verified.
de: Die E-Mail-Adresse für dieses Benutzerkonto ist bereits verifiziert.
fi: Sähköpostiosoite tälle käyttäjätilille on jo varmistettu.
fr: L'adresse e-mail pour ce compte a déjà été confirmé.
it_it: L'indirizzo di posta elettronica per questo account è stato già verificato
nl_nl: Het e-mailadres voor dit account is al bevestigd.
no: Epostadressen for denne kontoen er allerede verifisert.
pt_br: O endereço de email para esta conta já está verificado.
ru_ru: Email для данного аккаунта уже подтвержден.
sk: E-mailová adresa pre tento účet je už overená.
sv: E-postadressen för detta konto är redan bekräftad.
zh_cn: 此帐户的电子邮件地址已通过验证。

# AccountCreateFailNoEmailFromIdp
source: Can't create an account because there was no email from the identity provider.
de: Es kann kein Konto erstellt werden, da es keine E-Mail vom Identity-Provider gab.
fi: Käyttäjätiliä ei voida luoda koska varmennussähköpostia ei ole vastaanotettu identiteetin varmistajalta.
fr: Impossible de créer un compte car aucune adresse de mail du fournisseur d'identité n'est présent.
it_it: Impossibile creare un account perchè non ci sono email restituite dal Provider di Identità.
nl_nl: Kan geen account aanmaken omdat er geen e-mailadres van de identiteitsprovider aanwezig is.
no: Konto kan ikke opprettes fordi det mangler en epost fra identitetstilbyderen.
pt_br: Não é possível criar uma conta porque o provedor de identidade não contém email.
ru_ru: Невозможно создать аккаунт, т.к. отсутствует email в идентификационном провайдере.
sk: Nemožno vytvoriť účet, pretože tam nebol žiadny e-mail od poskytovateľa identity.
sv: Kontot kunde inte skapas eftersom det inte kommit ett e-postmeddelande från identitetsleverantören.
zh_cn: 无法创建一个帐户,因为没有从电子邮件的身份认证提供者。

# AccountNotConfiguredWithSecretQuestion
source: This account is not configured with a secret question or answer.
de: Dieses Konto ist nicht für eine Sicherheitsfrage oder -antwort konfiguriert.
fi: Tälle käyttäjätilille ei ole määritelty salaista kysymystä taikka sen vastausta.
fr: Il n'y a pas encore définie une question secrète pour ce compte.
it_it: L'account non è configurato con una domanda o risposta segreta.
nl_nl: Er is nog geen geheime vraag voor dit account ingesteld.
no: Kontoen er ikke konfigurert for å benytte sikkerhetsspørsmål og -svar.
pt_br: Não foi configurado uma pergunta ou resposta secreta para esta conta.
ru_ru: Этот аккаунт не настроен на использование секретного вопроса и ответа.
sk: Tento účet nie je nakonfigurovaný s tajnou otázkou alebo odpoveďou.
sv: Säkerhetsfråga saknas för detta konto.
zh_cn: 此帐户未配置为使用一个密码提示问题和答案。

# AccountNotVerified
source: The email address for this account is not yet verified.
de: Die E-Mail-Adresse für dieses Benutzerkonto wurde noch nicht verifiziert.
fi: Tämän käyttäjätilin sähköpostiosoitetta ei ole vielä varmistettu.
fr: L'adresse e-mail pour ce compte n'a pas encore été confirmée.
it_it: L'indirizzo di posta elettronica per questo account non è stato verificato.
nl_nl: Het e-mailadres voor dit account is nog niet bevestigd.
no: Epostadressen for denne kontoen er ikke verifisert enda.
pt_br: O endereço de email desta conta ainda não foi verificado.
ru_ru: Email для данного аккаунта еще не подтвержден.
sk: E-mailová adresa pre tento účet ešte nie je overená.
sv: E-postadressen för detta konto har inte bekräftats.
zh_cn: 此帐户的电子邮件地址尚未验证。

# AccountPasswordResetRequiresSecretQuestion
source: This account requires a secret question and answer to reset the password.
de: Dieses Konto benötigt eine Sicherheitsfrage oder -antwort, um das Passwort zurücksetzen zu können.
fi: Tämä käyttäjätili vaatii salaisen kysymyksen ja sen vastauksen salasanan resetointia varten.
fr: Ce compte exige une question secrète et une réponse à réinitialiser le mot de passe.
it_it: Per eseguire il reset della Password l'account richiede una domanda e risposta segreta.
nl_nl: Dit account vereist een geheime vraag en antwoord om het wachtwoord opnieuw in te stellen.
no: Denne kontoen krever et sikkerhetsspørsmål og -svar.
pt_br: Esta conta requer uma pergunta e resposta secreta para resetar a senha.
ru_ru: Для сброса пароля данного аккаунта необходимо наличие секретного вопроса и ответа.
sk: Tento účet vyžaduje tajnú otázku a odpoveď na reset hesla.
sv: Säkerhetsfrågan måste besvaras för att återställa lösenordet.
zh_cn: 此帐户需要一个密码提示问题和答案来重设密码。

# AddClientCertForTwoFactor
source: Add a client certificate to enable certificate two factor authentication.
de: Fügen Sie bitte ein Client-Zertifikat hinzu, um Zertifikats-Zwei-Faktoren-Authentifizierung zu ermöglichen.
fi: Lisää käyttäjäsertifikaatti kahden tason varmennuksen käyttämiseksi.
fr: Ajouter un certificat client pour activer l'authentification two factor par un certificat.
it_it: Aggiungi un certificato per abilitare Two Factor Authentication.
nl_nl: Voeg een client certificaat toe om twee staps authenticatie met een certificaat mogelijk te maken.
no: Legg til et klientsertifikat for å aktivere 2-faktor autentisering.
pt_br: Adicione um cliente certificado para habilitar a autenticação de duas fases.
ru_ru: Добавьте пользовательский сертификат, чтобы настроить двухфакторную аутентификацию.
sk: Pridajte klientsky certifikát pre potreby overenia druhým faktorom.
sv: Lägg till ett klientcertifikat för att aktivera tvåstegsverifiering.
zh_cn: 添加一个客户端证书,使两个因素身份验证证书。

# CantRemoveLastLinkedAccountIfNoPassword
source: You must set a password on the local account before you remove the last external login provider.
de: Sie müssen ein Passwort auf dem lokalen Konto festlegen, ehe Sie den letzten externen Login-Provider entfernen.
fi: Sinun täytyy asettaa salasana paikalliselle käyttäjätilille ennen kuin voit poistaa viimeisen ulkoisen kirjautumisen tarjoajan.
fr: Vous devez avoir définie un mot de passe sur la configuration des comptes locaux avant de supprimer le dernier externe login de connexion.
nl_nl: U moet een wachtwoord op het lokale account instellen voordat u de laatste externe login provider verwijderd.
no: Du må sette et passord på den lokale kontoen før du fjerner den siste eksterne påloggstilbyderen.
pt_br: Você precisa configurar uma senha para a conta local antes de remover o último provedor externo.
ru_ru: Вы должны задать пароль локального аккаунта, перед тем как удалить последний внешний авторизационный аккаунт.
sk: Pred odobratím posledného externého poskytovateľa prihlásenia je nutné nastaviť heslo pre lokálne konto.
sv: Du måste ange ett lösenord för det lokala kontot innan du deaktiverar det externa kontot.
zh_cn: 您必须设置一个密码的本地帐户,然后您删除最后一个外部登录提供商。

# CertificateAlreadyInUse
source: That certificate is already in use by a different account.
de: Dieses Zertifikat wird bereits von einem anderen Konto verwendet.
fi: Määritelty sertifikaatti on jo käytössä toisella käyttäjätilillä.
fr: Le certificat est déjà utilisé par un autre compte.
it_it: Il certificato è già in uso da un'altro utente
nl_nl: Het certificaat is al in gebruik door een ander account.
no: Dette sertifikatet er allerede i bruk av en annen konto
pt_br: Este certificado já está em uso por uma conta diferente.
ru_ru: Этот сертификат уже используется другим аккаунтом.
sk: Tento certifikát už používa iný účet.
sv: Certifikatet används redan i ett annat konto.
zh_cn: 该证书已经在使用一个不同的帐户。

source: Code required.
de: Code wird benötigt.
fi: Koodi vaadittu.
fr: Le code est obligatoire.
it_it: Codice richiesto.
nl_nl: Code is verplicht.
no: Kode kreves.
pt_br: Código obrigatório.
ru_ru: Необходимо указать код.
sk: Kód je povinný.
sv: Kod krävs.
zh_cn: 代码需要

source: Email already in use.
de: Diese E-Mail-Adresse ist bereits in Gebrauch.
fi: Sähköpostiosoite jo käytössä.
fr: Cette adresse e-mail est déjà utilisé.
it_it: Indirizzo di posta elettronica già in uso
nl_nl: E-mailadres is al ingebruik.
no: Epostadressen er allerede i bruk.
pt_br: Email já está em uso.
ru_ru: Этот email уже зарегистрирован.
sk: Email sa už používa.
sv: E-postadressen används redan.
zh_cn: 电子邮件地址已在使用中。

# EmailRequired
source: Email is required.
de: Die E-Mail-Adresse wird benötigt.
fi: Sähköpostiosoite vaadittu.
fr: Une adresse e-mail est nécessaire.
it_it: Indirizzo di posta elettronica obbligatorio
nl_nl: E-mailadres is verplicht.
no: Epost er påkrevet.
pt_br: Email obrigatório.
ru_ru: Необходимо указать email.
sk: Email je povinný.
sv: E-postadress krävs.
zh_cn: 电子邮件是必填的。

source: Invalid certificate.
de: Ungültiges Zertifikat.
fi: Virheellinen sertifikaatti.
fr: Certificat non valide.
it_it: Certificato non valido.
nl_nl: Ongeldig certificaat.
no: Ugyldig sertifikat
pt_br: Certificado inválido.
ru_ru: Невалидный сертификат.
sk: Neplatný certifikát.
sv: Ogiltigt certifikat
zh_cn: 证书无效。

source: Invalid email.
de: Ungültige E-Mail-Adresse.
fi: Virheellinen sähköpostiosoite.
fr: Adresse e-mail non valide.
it_it: Indirizzo di posta elettronica non valido
nl_nl: Ongeldig e-mailadres.
no: Ugyldig epost.
pt_br: Email inválido.
ru_ru: Невалидный email.
sk: Neplatný email.
sv: Ogiltig e-post.
zh_cn: 无效的电子邮件地址。

source: Invalid key.
de: Ungültiger Schlüssel.
fi: Virheellinen avain.
fr: Clé non valide.
it_it: Chiave non valida.
nl_nl: Ongeldige sleutel.
no: Ugyldig nøkkel.
pt_br: Chave inválida.
ru_ru: Невалидный ключ.
sk: Neplatný kľúč.
sv: Ogiltig nyckel.
zh_cn: 无效的密钥。

source: Invalid name.
de: Ungültiger Name.
fi: Virheellinen nimi.
fr: Nom non valide.
it_it: Nome non valido
nl_nl: Ongeldige naam.
no: Ugyldig navn.
pt_br: Nome inválido.
ru_ru: Невалидное имя.
sk: Neplatné meno.
sv: Ogiltigt namn.
zh_cn: 无效的名称。

source: Invalid new password.
de: Ungültiges neues Passwort.
fi: Virheellinen uusi salasana.
fr: Nouveau mot de passe non valide.
it_it: Nuova password non valida.
nl_nl: Ongeldig nieuw wachtwoord.
no: Ugyldig nytt passord.
pt_br: Nova senha inválida.
ru_ru: Невалидный новый пароль.
sk: Neplatné nové heslo.
sv: Det nya lösenordet är ogiltigt.
zh_cn: 新密码无效。

source: Invalid old password.
de: Ungültiges altes Passwort.
fi: Virheellinen vanha salasana.
fr: Ancien mot de passe non valide.
it_it: Vecchia password non valida.
nl_nl: Ongeldig oud wachtwoord.
no: Ugyldig gammelt passord.
pt_br: Senha antiga inválida.
ru_ru: Невалидный старый пароль.
sk: Neplatné staré heslo.
sv: Det tidigare lösenordet är felaktigt.
zh_cn: 旧密码无效。

source: Invalid password.
de: Ungültiges Passwort.
fi: Virheellinen salasana.
fr: Mot de passe non valide.
it_it: Password errata.
nl_nl: Ongeldig wachtwoord.
no: Ugyldig passord.
pt_br: Senha inválida.
ru_ru: Невалидный пароль.
sk: Neplatné heslo.
sv: Felaktigt lösenord.
zh_cn: 无效的密码。

# InvalidPhone
source: Invalid phone number.
de: Ungültige Telefonnummer.
fi: Virheellinen puhelinnumero.
fr: Numéro de téléphone non valide.
it_it: Numero di telefono non valido
nl_nl: Ongeldig telefoonnummer.
no: Ugyldig telefonnummer.
pt_br: Número de telefone inválido.
ru_ru: Невалидный номер телефона.
sk: Neplatné telefónne číslo.
sv: Ogiltigt telefonnummer.
zh_cn: 无效的电话号码。

# InvalidQuestionOrAnswer
source: Invalid secret question or answer.
de: Ungültige Sicherheitsfrage oder -antwort.
fi: Virheellinen salainen kysymys tai sen vastaus.
fr: Question secrète ou réponse non valide
it_it: Domanda o Risposta segreta non valida
nl_nl: Ongeldige geheime vraag of antwoord.
no: Ugyldig sikkerhetsspørsmål.
pt_br: Pergunta ou resposta secreta inválida.
ru_ru: Невалидный секретный вопрос или ответ.
sk: Neplatná tajná otázka alebo odpoveď.
sv: Ogiltig säkerhetsfråga.
zh_cn: 无效的秘密问题和答案。

source: Invalid tenant.
de: Ungültiger Inhaber.
fi: Virheellinen haltija.
fr: Locataire non valide.
it_it: Dominio non valido
nl_nl: Ongeldige tenant.
no: Ugyldig leietaker.
pt_br: Tenant inválido.
ru_ru: Невалидный арендатор.
sk: Neplatný tenant.
sv: Ogiltig innehavare.
zh_cn: 无效用户。

source: Invalid username.
de: Ungültiger Benutzername.
fi: Virheellinen käyttäjänimi.
fr: Nom d'utilisateur non valide
it_it: Nome Utente non valido
nl_nl: Ongeldige gebruikersnaam.
no: Ugyldig brukernavn.
pt_br: Usuário inválido.
ru_ru: Невалидное имя пользователя.
sk: Neplatné prihlasovacie meno.
sv: Ogiltigt användarnamn.
zh_cn: 无效的用户名。

# LoginFailEmailAlreadyAssociated
source: Can't login with this provider because the email is already associated with another account. Please login with your local account and then associate the provider.
de: Mit diesem Provider ist kein Login möglich, weil die E-Mail-Adresse bereits einem anderen Konto zugeordnet ist. Bitte loggen Sie sich mit Ihrem lokalen Konto ein und weisen den Provider dann zu.
fi: Mahdotonta kirjautua tämän palvelun tarjoajan tilille, koska sähköpostiosoite on jo yhdistetty toiseen tiliin. Kirjaudu käyttäen paikallista tiliäsi ja liitä sitten palvelun tarjoaja mukaan.
fr: Impossible de connecter avec ce fournisseur, parce que l'adresse e-mail est déjà associé à un autre utilisateur. Connectez-vous avec votre compte local, ensuite lier le fournisseur.
it_it: Non puoi eseguire il l'accesso con questo provider perchè l'email è già associata ad un altro account. Esegui l'accesso con il tuo account locale e poi associa il Provider.
nl_nl: Kan niet inloggen met deze provider, omdat het e-mailadres is al gekoppeld aan een andere gebruiker. Log in met uw lokale account en koppel vervolgens de provider.
no: Kan ikke logge inn med denne påloggstilbyderen fordi e-posten allerede er knyttet til en annen konto. Logg deg inn med din lokale konto og deretter knytt til deg påloggstilbyderen.
pt_br: Não é possível logar com este provedor porque o email já está associado a outra conta. Por favor, logue com sua conta local e entao vincule ao provedor.
ru_ru: Невозможно войти с данным поставщиком, т.к. email уже ассоциирован с другим аккаунтом. Пожалуйста, войдите под своим локальным аккаунтом, а затем ассоциируйте поставщика.
sk: Nedá sa prihlásiť pomocou tohto poskytovateľa, pretože email je už prepojený s iným účtom. Prosím, prihláste sa pomocou svojho lokálneho účtu a potom priraďte poskytovateľa.
sv: Kan inte logga in med det externa kontot eftersom e-postadressen redan är kopplad till ett annat konto. Logga in med ditt lokala konto och lägg sedan till det externa kontot.
zh_cn: 无法登录,因为该提供者的电子邮件地址已经与其它帐户关联。 请登录您的本地帐户,然后将该提供商。

# LoginNotAllowed
source: Login not allowed for this account.
de: Der Login ist für dieses Konto nicht erlaubt.
fi: Sisäänkirjautuminen ei sallittu tälle käyttäjätilille.
fr: Connexion n'est pas autorisée pour ce compte.
it_it: Login non è permesso per questo account.
nl_nl: Inloggen is niet toegestaan ​​voor dit account.
no: Login ikke tillatt for denne kontoen.
pt_br: Login não está habilitado para está conta.
ru_ru: Для данного аккаунта вход не разрешен.
sk: Prihlásenie nie je povolené pre tento účet.
sv: Inloggning är inte tillåtet för detta konto.
zh_cn: 这个帐户不允许登录

# MobilePhoneAlreadyInUse
source: That mobile phone is already in use by a different account.
de: Diese Mobilfunknummer ist bereits durch ein anderes Konto in Gebrauch.
fi: Puhelinnumero on käytössä jo toisella käyttäjätilillä.
fr: Le numéro de téléphone mobile est déjà utilisé par un autre utilisateur.
it_it: Numero di cellulare già in uso da un altro account.
nl_nl: Het mobiele telefoonnummer is al in gebruik door een andere gebruiker.
no: Mobiltelefonen er allerede i bruk av en annen konto.
pt_br: O número de telefone já está em uso em outra conta.
ru_ru: Этот номер телефона уже используется другим аккаунтом.
sk: Toto telefónne číslo je už použité iným účtom.
sv: Mobilnumret används i ett annat konto.
zh_cn: 该手机已在使用的一个不同的帐户。

# MobilePhoneMustBeDifferent
source: Mobile phone number must be different then the current.
de: Die Mobilfunknummer muss von der jetzigen verschieden sein.
fi: Puhelinnumeron tulee olla eri kuin aikaisemmin määritelty.
fr: Le numéro de téléphone mobile ne peut pas être le même que votre numéro de téléphone actuel.
it_it: Il numero di cellulare deve essere diverso da quello corrente.
nl_nl: Het mobiele telefoonnummer mag niet hetzelfde zijn als uw huidige telefoonnummer.
no: Mobilnummer må være forskjellig da den nåværende.
pt_br: O número de telefone precisa ser diferente do atual.
ru_ru: Номер телефона должен отличаться от текущего.
sk: Telefónne číslo musí byť iné ako je aktuálne.
sv: Det nya mobilnumret får inte vara samma som det gamla.
zh_cn: 手机号码必须是不同于当前。

# MobilePhoneRequired
source: Mobile phone number required.
de: Eine Mobilfunknummer wird benötigt.
fi: Puhelinnumero vaadittu.
fr: Le numéro de téléphone mobile est nécessaire.
it_it: Numero di cellulare obbligatorio
nl_nl: Het mobiele telefoonnummer is verplicht.
no: Mobiltelefonnummer er påkrevet felt.
pt_br: Número do telefone é obrigatório.
ru_ru: Необходимо указать номер мобильного телефона.
sk: Telefónne číslo je povinné.
sv: Mobilnummer krävs.
zh_cn: 移动电话号码。

# NameAlreadyInUse
source: That name is already in use.
de: Dieser Name ist bereits in Gebrauch.
fi: Nimi on jo käytössä.
fr: Ce nom est déjà utilisé.
it_it: Nome già in uso
nl_nl: Deze naam is al in gebruik.
no: Det navnet er allerede i bruk.
pt_br: Este nome já está em uso.
ru_ru: Это имя уже используется.
sk: Toto meno je už použité.
sv: Det namnet används redan.
zh_cn: 该名称已在使用中。

# NameRequired
source: Name is required.
de: Ein Name wird benötigt.
fi: Nimi on vaadittu.
fr: Le nom est obligatoire.
it_it: Nome obbligatorio
nl_nl: Naam is verplicht.
no: Navn er påkrevd.
pt_br: Nome é obrigatório.
ru_ru: Необходимо указать имя.
sk: Meno je povinné.
sv: Namn krävs.
zh_cn: 名称是必需的。

# NewPasswordMustBeDifferent
source: The new password must be different than the old password.
de: Das neue Passwort muss vom alten Passwort verschieden sein.
fi: Uuden salasanan tulee olla eri kuin vanha salasana.
fr: Votre mot de passe doit être différent de votre mot de passe actuel.
it_it: La nuova password deve essere differente rispetto la vecchia
nl_nl: Uw wachtwoord mag niet hetzelfde zijn als uw huidige wachtwoord.
no: Det nye passordet må være annerledes enn det gamle passordet.
pt_br: A nova senha precisa ser diferente.
ru_ru: Новый пароль должен отличаться от текущего.
sk: Nové heslo musí byť odlišné od starého hesla.
sv: Det nya lösenordet får inte vara samma som det gamla.
zh_cn: 新密码必须不同于旧的密码。

# ParentGroupAlreadyChild
source: The parent group is already a child of the child group.
de: Die Elterngruppe ist bereits ein Kind der Kindgruppe.
fi: Emoryhmä on jo tytärryhmän tytär.
fr: le groupe en tête est déjà membre du groupe sous-jacent.
it_it: Il gruppo radice è già figlio del gruppo figlio.
nl_nl: De bovenliggende groep is al lid van de onderliggende groep.
no: Den overordnede gruppen er allerede et barn av barnegruppen.
pt_br: Este grupo pai já é filho de um grupo filho.
ru_ru: Родительская группа уже является дочерней у дочерней группы.
sv: Den överordnade gruppen är redan medlem i den underordnade gruppen.
zh_cn: 父级组已经是一个儿童的子组。

# ParentGroupSameAsChild
source: The parent and child are the same groups.
de: Eltern und Kind sind dieselbe Gruppe.
fi: Emo- ja tytärryhmä ovat sama ryhmä.
fr: le groupe en tête et le groupe sous-jacent sont les mêmes.
it_it: La radice e il figlio sono lo stesso gruppo.
nl_nl: De bovenliggende groep en onderliggende groep zijn de zelfde groep.
no: Foreldre og barn er den samme gruppen.
pt_br: O grupo pai e o grupo filho são os mesmos.
ru_ru: Родительская и дочерняя группы идентичны.
sv: Den överordnade gruppen är samma som den underordnade.
zh_cn: 父和子是同一组。

# PasswordComplexityRules
source: Password must contain at least {0} of the follwing characters: one upper, one lower, one digit and one other.
de: Das Passwort muss mindestens {0} der folgenden Zeichen enthalten: Großbuchstabe, Kleinbuchstabe, Zahl und Sonstiges.
fi: Salasanan on sisällettävä vähintään {0} seuraavista merkeistä: suuraakkonen, pienaakkonen, numero ja jokin muu.
fr: Le mot de passe doit être au moins {0} des caractères suivants: une lettre majuscule, une minuscule, un chiffre et un caractère spécial.
it_it: La password deve contenere almeno {0} dei seguenti caratteri: una lettera maiuscola, una lettera minuscola, un numero e un carattere speciale.
nl_nl: Het wachtwoord moet minimaal {0} van de volgende tekens bevatten: één hoofdletter, één kleine letter, één cijfer en één speciaal teken.
no: Passordet må inneholde minst {0} av følgende tegn: en stor bokstav, en liten bokstav, ett tall og ett annet.
pt_br: A senha deve conter pelo menos {0} dos seguintes caractéres: caixa alta, caixa baixa, pele menos um dígito.
ru_ru: Пароль должен содержать как минимум {0} следующих символов: один в верхнем регистре, один - в нижнем, одну цифру и одну другую.
sk: Heslo musí obsahovať aspoň {0} z nasledovných znakov: jeden malý, jeden veľký, jedno číslo a jeden ďalší.
sv: Lösenordet måste innehålla minst {0} av följande teckenkategorier: versaler, gemener, siffror och specialsymboler.
zh_cn: 密码必须至少包含如{0}的以下字符:0上,一个小写、一个数字和一个其他。

# PasswordLength
source: Password must be at least {0} characters long.
de: Das Passwort muss mindestens {0} Zeichen lang sein.
fi: Salasanan pituuden on oltava vähintään {0} merkkiä.
fr: Le mot de passe doit être au moins {0} caractères.
it_it: La password deve essere di almeno {0} caratteri.
nl_nl: Het wachtwoord moet minimaal {0} tekens lang zijn.
no: Passord må være minst {0} tegn.
pt_br: A senha deve conter pelo menos {0} caracteres.
ru_ru: Пароль должен содержать как минимум {0} символов.
sk: Heslo musí byť aspoň {0} znakov dlhé.
sv: Lösenord innehålla minst {0} tecken.
zh_cn: 密码必须至少包含{0}字符长。

# PasswordRequired
source: Password is required.
de: Passwort wird benötigt.
fi: Vaaditaan salasana.
fr: Mot de passe est obligatoire .
it_it: Password richiesta.
nl_nl: Wachtwoord is verplicht.
no: Passord er påkrevd.
pt_br: Senha é obrigatória.
ru_ru: Необходимо указать пароль.
sk: Heslo je povinné.
sv: Lösenord krävs.
zh_cn: 密码是必需的。

# PasswordResetErrorNoEmail
source: Password reset is not possible since there is no verified email address for this account.
de: Passwort zurücksetzen ist nicht möglich, da für dieses Konto keine verifizierte E-Mail-Adresse hinterlegt ist.
fi: Annettu salasana ei ole mahdollinen, koska tilille ei ole tarkastettua sähköpostiosoitetta.
fr: Récupération de mot de passe n'est pas possible car il n'y a pas d'adresse e-mail confirmée pour ce compte.
it_it: Il reset della Password non può essere eseguito fino a quando l'indirizzo di posta elettronica per questo account non è verificato.
nl_nl: Wachtwoord herstel is niet mogelijk omdat er geen bevestigd e-mailadres voor dit account aanwezig is.
no: Reset passord er ikke mulig siden det ikke er noen e-post adresse for denne kontoen.
pt_br: Não é possível redefinir a senha uma vez que o email ainda não foi verifiado para esta conta.
ru_ru: Сброс пароля невозможен, т.к. email для данного аккаунта не подтвержден.
sk: Resetovanie hesla nie je možné, lebo e-mailová adresa nebola overená pre tento účet.
sv: Lösenordsåterställning är inte möjligt eftersom det inte finns en bekräftad e-postadress för detta konto.
zh_cn: 密码重置不可能因为没有验证此帐户的电子邮件地址。
