Repository: brockallen/BrockAllen.MembershipReboot
Catalog: src/BrockAllen.MembershipReboot/Resources/ValidationMessages.*.resx
Languages: de, fi, fr, it_it, nl_nl, no, pt_br, ru_ru, sk, sv, zh_cn

# RegisterMobileForTwoFactor
source: Register a mobile phone number to enable mobile two factor authentication.
de: Registrieren Sie bitte eine Mobilfunknummer, um mobile Zwei-Faktoren-Authentifizierung zu ermöglichen.
fi: Rekisteröi matkapuhelinnumero kaksiosaisen kännykkätodennuksen mahdollistamiseksi.
fr: Ajouter un numéro de téléphone mobile pour activer l'authentification à two factor en utilisant un téléphone mobile.
it_it: Registra un numero di cellulare per attivare la funzionalità Two Factor Authentication.
nl_nl: Voeg een mobiel telefoonnummer toe om twee staps authenticatie met een mobiele telefoon mogelijk te maken.
no: Registrer et mobilnummer for å aktivere mobil 2-faktor autentisering.
pt_br: Registre um número de telefone para habilitar a autenticação em duas fases.
ru_ru: Укажите номер мобильного телефона, чтобы использовать мобильную двухфакторную аутентификацию.
sk: Zaregistrujte číslo mobilného telefónu, pre možnosť dvojfaktorového overenie cez SMS.
sv: Registrera ett mobilnummer för att aktivera tvåstegsverifiering via mobiltelefon.
zh_cn: 注册一个手机号码,让移动双因素身份验证。

# ReopenErrorNoEmail
source: Reopening the account is not possible since there is no email address for this account.
de: Wiedereröffnen des Kontos ist nicht möglich, da für dieses Konto keine E-Mail-Adresse hinterlegt ist.
fi: Tiliä ei voi avata uudelleen, koska tiliin ei ole yhdistetty mitään sähköpostiosoitetta.
fr: Réouverture du compte n'est pas possible car aucune adresse e-mail n'a été définie pour ce compte.
nl_nl: Heropening van het account is niet mogelijk omdat er geen e-mailadres is ingesteld voor dit account.
no: Gjenåpning av konto er ikke mulig siden det ikke er noen e-postadresse for denne kontoen.
pt_br: Não é possível reabrir a conta visto que não há email para esta conta.
ru_ru: Повторное открытие аккаунта невозможно, т.к. для данного аккаунта не указан email адрес.
sk: Znovuotvorenie účtu nie je možné, pretože neexistuje žiadna e-mailová adresa pre tento účet.
sv: Det går inte att återöppna kontot eftersom det inte finns någon e-postadress för detta konto.
zh_cn: 重新打开该帐户是不可能因为没有此帐户的电子邮件地址。

source: Secret answer required.
de: Eine Sicherheitsantwort wird benötigt.
fi: Vaaditaan salainen vastaus.
fr: Réponse secrète est obligatoire .
it_it: Risposta segreta obbligatoria.
nl_nl: Geheim antwoord is verplicht.
no: Hemmelig svar påkrevd.
pt_br: Resposta secreta é obrigatória.
ru_ru: Необходимо указать секретный ответ.
sk: Tajná odpoveď je povinná.
sv: Säkerhetsfrågan måste besvaras.
zh_cn: 所需密码提示问题的答案。

# SecretQuestionAlreadyInUse
source: That password reset secret question is already being used.
de: Diese Passwort-Rücksetzen-Sicherheitsfrage ist bereits im Gebrauch.
fi: Tämä salasanan salainen kysymys on jo käytössä.
fr: Cette question secrète a déjà été utilisé.
it_it: La domanda segreta per il reset della password è già stata utilizzata.
nl_nl: Deze geheime vraag is al gebruikt.
no: Det sikkerhetsspørsmålet for tilbakestilling av passordet er allerede i bruk.
pt_br: Essa redefinição de pergunta secreta já está sendo usado.
ru_ru: Этот секретный вопрос для сброса пароля уже используется.
sk: Táto tajná otázka pre resetovanie hesla je už použitá.
sv: Denna säkerhetsfråga har redan använts för lösenordsåterställning.
zh_cn: 该密码重置密码提示问题已被使用。

source: Secret question required.
de: Eine Sicherheitsfrage wird benötigt.
fi: Vaaditaan salainen kysymys.
fr: Question secrète est obligatoire.
it_it: Domanda segreta Obbligatoria.
nl_nl: Geheime vraag is verplicht.
no: Sikkerhetsspørsmål er påkrevet.
pt_br: Pergunta secreta é obrigatória.
ru_ru: Необходимо указать секретный вопрос.
sk: Tajná otázka je povinná.
sv: Säkerhetsfråga krävs.
zh_cn: 所需密码提示问题。

# TenantRequired
source: Tenant is required.
de: Ein Inhaber wird benötigt.
fi: Vaaditaan haltija.
fr: Le locataire est obligatoire.
it_it: Dominio richiesto
nl_nl: De tenant is verplicht.
no: Leietaker er nødvendig.
pt_br: Tenant é obrigatório.
ru_ru: Необходимо указать арендатора.
sk: Tenant je povinný.
sv: Innehavare krävs.
zh_cn: 租户是必需的。

source: Username already in use.
de: Dieser Benutzername ist bereits in Gebrauch.
fi: Käyttäjätunnus on jo käytössä.
fr: Ce nom d'utilisateur est déjà utilisé.
it_it: Nome Utente esistente
nl_nl: Deze gebruikersnaam is al in gebruik.
no: Brukernavn er allerede er i bruk.
pt_br: Usuário já está em uso.
ru_ru: Это имя пользователя уже используется.
sk: Prihlasovacie meno je už použité.
sv: Användarnamnet används redan.
zh_cn: 用户名已在使用中。

# UsernameCannotContainAtSign
source: Username cannot contain the '@' character.
de: Der Benutzername darf nicht das '@'-Symbol enthalten.
fi: Käyttäjätunnus ei voi sisältää merkkiä @.
fr: Le nom d'utilisateur ne peut pas contenir le signe '@'
it_it: Il Nome Utente non può contenere il carattere '@'.
nl_nl: De gebruikersnaam mag geen '@' teken bevatten.
no: Brukernavn kan ikke inneholde '@'-tegnet.
pt_br: Usuário não pode conter '@'.
ru_ru: Имя пользователя не может содержать символ '@'.
sk: Prihlasovacie meno nemôže obsahovať znak '@'.
sv: Användarnamnet får inte innehålla "@"-tecken.
zh_cn: 用户名不能包含'@'字符。

# UsernameOnlyContainLettersAndDigits
source: Username can only contain letters and digits.
it_it: Il Nome Utente può contenere Lettere e Numeri
ru_ru: Имя пользователя может содержать только буквы и цифры.
sk: Prihlasovacie meno môže obsahovať len písmena a číslice.

# UsernameRequired
source: Username is required.
de: Ein Benutzername wird benötigt.
fi: Vaaditaan käyttäjätunnus.
fr: Nom d'utilisateur est obligatoire.
it_it: Nome Utente obbligatorio
nl_nl: Gebruikersnaam is verplicht.
no: Brukernavn er påkrevd.
pt_br: Usuário é obrigatório.
ru_ru: Необходимо указать имя пользователя.
sk: Prihlasovacie meno je povinné.
sv: Användarnamn krävs.
zh_cn: 用户名是必需的。
